
abc = ("a", "b", "c", "d", "e", "f", "g", "h", "i", "j", "k", "l", "m",
       "n", "o", "p", "q", "r", "s", "t", "u", "v", "w", "x", "y", "z")

alphabet = ("а", "б", "в", "г", "д", "е", "ё", "ж", "з", "и", "й", "к", "л", "м",
            "н", "о", "п", "р", "с", "т", "у", "ф", "х", "ц", "ч", "ш",
            "щ", "ъ", "ы", "ь", "э", "ю", "я")

dictionary = {"q": "й", "w": "ц", "e": "у", "r": "к", "t": "е", "y": "н",
              "u": "г", "i": "ш", "o": "щ", "p": "з", "[": "х", "]": "ъ",
              "a": "ф", "s": "ы", "d": "в", "f": "а", "g": "п", "h": "р",
              "j": "о", "k": "л", "l": "д", ";": "ж", "'": "э", "z": "я",
              "x": "ч", "c": "с", "v": "м", "b": "и", "n": "т", "m": "ь",
              ",": "б", ".": "ю", "/": ".", "{": "Х", "}": "Ъ", "|": "\\",
              ":": "Ж", '"': "Э", "<": "Б", ">": "Ю", "?": ",", "`": "ё",
              "~": "ё", "1": "1", "2": "2", "3": "3", "4": "4", "5": "5",
              "6": "6", "7": "7", "8": "8", "9": "9", "0": "0", "-": "-",
              "=": "=", "+": "+", "*": "*", "%": "%", "!": "!", "@": '"',
              "#": "№", "$": ";", "^": ":", "&": "?", '|': "/", ' ': " ",
              "(": "(", ")": ")", "_": "_", "\\": "\\"}
# ________________________________________________________________________


def fix_func(x):
    global abc, alphabet
    name = ""
    newName = ""
    up = []
    a = -1
    c = -1
    dct = dictionary
    dctinv = dictionary
    dctinv = {v: k for k, v in dct.items()}

    inp = x

    for i in inp:  # Если есть верхний регистр, пишем его индексы в up
        a += 1
        if i.isupper():
            up.append(a)

    inp = inp.lower()  # Переводим всё в нижний регистр

    for i in inp:  # __________________Исправляем раскладку))
        xd = dct
        if i in abc:
            pass
        elif i in alphabet:
            xd = dctinv
        b = str(xd.get(i))
        name += b

    for i in name:  # Возвращаем регистры букв из up
        c += 1
        if c in up:
            i = i.upper()
        newName += i

    result = newName
    del dct
    return result
